const { botName, channelId } = require('./constants')

const welcomeText = `
	🔥 <b>به ${botName} خوش آمدید</b>🔥
	
	✅ شما در اینجا می توانید آگهی های پروژه ای خود را بگذارید و در کوتاهترین زمان فردی برای انجام پروژه های خود را پیدا کنید
	
	🔶 نکات :
	
🔸 شما برای درج آگهی های خود می توانید بر روی گزینه ی ثبت آگهی کلیک کنید و با راهتمایی های بات به جلو پیش بروید و آگهی های خود را در داخل چنل ثبت کنید

 🔴 استفاده از خدمات این بات و چنل رایگان میباشد!!! 🔴

🔰 آدرس کانال:
 ${channelId}
`

const addAdvText = `
	⚖ قوانین جهت درج آگهی  ️⚖️
	
	🔻 از به کار بردن الفاظ و کلمات زشت به شدت پرهیز کنید در صورت مشاهده حذف خواهند شد
	
	🔻 امکان گرفتن تست از طرف ادمین ها وجود ندارد
	
	🔻 آگهی هایی اعم از امتحان، تست و ... مجاز نمی باشند و امکان درج آنها وجود نخواهد داشت
	
	🔻 لطفا درخواست خود را به صورت واضح بیان کنید
	
	🔻 بعد از ثبت و درج شدن آگهی امکان ویرایش آن وجود ندارد
	
	🔻 جهت ارتباط وارد کردن شماره تلفن خود لزوم نیست و شما می توانید آی دی تلگرامی خود را جهت ارتباط وارد نمایید
	
	 🔻 از ثبت کردن صحیح آی دی و یا شماره تلفن مطمئن باشید زیرا پس از ثبت امکان ویرایش وجود نخواهد داشت
`

const exampleAdvText = `
🔹 نمونه آگهی 🔹

به یک نفر جهت کمک در حل تمرین در مورد برنامه نویسی نیاز دارم

${channelId}
`

const addUsernameText = `
	<b>لطفا آی دی یا شماره تلفن جهت درج در آگهی را وارد نمایید</b>
`

module.exports = {
	addAdvText,
	exampleAdvText,
	addUsernameText,
	welcomeText,
}
