const { botName, channelId, coinPerAdv } = require('./constants')

const welcomeText = `
	🔥 <b>به ${botName} خوش آمدید</b>🔥
	
	✅ شما در اینجا می توانید آگهی های پروژه ای خود را بگذارید و در کوتاهترین زمان فردی برای انجام پروژه های خود را پیدا کنید
	
	🔶 نکات :
	
🔸 شما برای درج آگهی های خود می توانید بر روی گزینه ی ثبت آگهی کلیک کنید و با راهتمایی های بات به جلو پیش بروید و آگهی های خود را در داخل چنل ثبت کنید

 🔴 استفاده از خدمات این بات و چنل رایگان میباشد!!! 🔴

🔰 آدرس کانال:
 ${channelId}
`

const addAdvText = `
	⚖ قوانین جهت درج آگهی  ️⚖️
	
	🔻 از به کار بردن الفاظ و کلمات زشت به شدت پرهیز کنید در صورت مشاهده حذف خواهند شد
	
	🔻 امکان گرفتن تست از طرف ادمین ها وجود ندارد
	
	🔻 هنگام درج آگهی در مرحله آخر جهت ثبت آگهی پرسیده میشود که انتظار میرود هنگام ثبت از نبودن اشتباهات مطمئن شوید
	
	🔻 آگهی هایی اعم از امتحان، تست و ... مجاز نمی باشند و امکان درج آنها وجود نخواهد داشت
	
	🔻 لطفا درخواست خود را به صورت واضح بیان کنید
	
	🔻 بعد از ثبت و درج شدن آگهی امکان ویرایش آن وجود ندارد
	
	🔻 جهت ارتباط وارد کردن شماره تلفن خود لزوم نیست و شما می توانید آی دی تلگرامی خود را جهت ارتباط وارد نمایید
	
	 🔻 از ثبت کردن صحیح آی دی و یا شماره تلفن مطمئن باشید زیرا پس از ثبت امکان ویرایش وجود نخواهد داشت
`

const exampleAdvText = `
🔹 نمونه آگهی 🔹

به یک نفر جهت کمک در حل تمرین در مورد برنامه نویسی نیاز دارم

${channelId}
------------------------

حالا متن مورد نظر جهت درج در آگهی را بنویسید: 
`

const addUsernameText = `
	<b>لطفا آی دی یا شماره تلفن جهت درج در آگهی را وارد نمایید</b>
`

const youMustSubscribe = `
🔴 جهت استفاده از خدمات بات باید در کانال عضو باشید 🔴

🔰 آدرس کانال:
 ${channelId}
`

const newUserWelcomeText = `
	🔴 شما اولین بار است که از خدمات ما استفاده می کنید 🔴
	
	🔹 برای کسایی که اولین بار از خدمات ما استفاده می کنند ${coinPerAdv} سکه به موجودی های آنان اضافه می شود
	
	🔸 شما می توانید با دعوت دوستان خود به ازای هر نفر 5 سکه بگیرید و با استفاده از آن سکه ها آگهی های خود را داخل کانال بگذارید
`

module.exports = {
	addAdvText,
	exampleAdvText,
	addUsernameText,
	welcomeText,
	youMustSubscribe,
	newUserWelcomeText,
}
